NTR/database/case_templates/openfoam_channel_les_dfilter_incompressible/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0.1;
    }

    "(U|k|nuTilda)Final"
    {
        $U;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors <var NOUTERCORRECTORS var>;  // 1;	1=PISO 1<PIMPLE
    nCorrectors      <var NCORRECTORS var>; // 1;	//outer loops
    nNonOrthogonalCorrectors <var NNONORTHOGONALCORRECTORS var>;	//p loops
    pRefCell        1001;
    pRefValue       0;
}


// ************************************************************************* //
